esp8266/Arduino/cores/esp8266/spiffs/spiffs_hydrogen.c
  res = spiffs_lookup_consistency_check(fs, 0);

  res = spiffs_object_index_consistency_check(fs);

  res = spiffs_page_consistency_check(fs);

  res = spiffs_obj_lu_scan(fs);

  SPIFFS_UNLOCK(fs);
  return res;
#endif // SPIFFS_READ_ONLY
}

s32_t SPIFFS_info(spiffs *fs, u32_t *total, u32_t *used) {
  s32_t res = SPIFFS_OK;
  SPIFFS_API_CHECK_CFG(fs);
  SPIFFS_API_CHECK_MOUNT(fs);
  SPIFFS_LOCK(fs);

  u32_t pages_per_block = SPIFFS_PAGES_PER_BLOCK(fs);
  u32_t blocks = fs->block_count;
  u32_t obj_lu_pages = SPIFFS_OBJ_LOOKUP_PAGES(fs);
  u32_t data_page_size = SPIFFS_DATA_PAGE_SIZE(fs);
  u32_t total_data_pages = (blocks - 2) * (pages_per_block - obj_lu_pages) + 1; // -2 for spare blocks, +1 for emergency page

  if (total) {
    *total = total_data_pages * data_page_size;
  }

  if (used) {
    *used = fs->stats_p_allocated * data_page_size;
  }

  SPIFFS_UNLOCK(fs);
  return res;
}

s32_t SPIFFS_gc_quick(spiffs *fs, u16_t max_free_pages) {
#if SPIFFS_READ_ONLY
  (void)fs; (void)max_free_pages;
  return SPIFFS_ERR_RO_NOT_IMPL;
#else
  s32_t res;
  SPIFFS_API_CHECK_CFG(fs);
  SPIFFS_API_CHECK_MOUNT(fs);
  SPIFFS_LOCK(fs);

  res = spiffs_gc_quick(fs, max_free_pages);

  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);
  SPIFFS_UNLOCK(fs);
  return 0;
#endif // SPIFFS_READ_ONLY
}


s32_t SPIFFS_gc(spiffs *fs, u32_t size) {
#if SPIFFS_READ_ONLY
  (void)fs; (void)size;
  return SPIFFS_ERR_RO_NOT_IMPL;
#else
  s32_t res;
  SPIFFS_API_CHECK_CFG(fs);
  SPIFFS_API_CHECK_MOUNT(fs);
  SPIFFS_LOCK(fs);

  res = spiffs_gc_check(fs, size);

  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);
  SPIFFS_UNLOCK(fs);
  return 0;
#endif // SPIFFS_READ_ONLY
}

s32_t SPIFFS_eof(spiffs *fs, spiffs_file fh) {
  s32_t res;
  SPIFFS_API_CHECK_CFG(fs);
  SPIFFS_API_CHECK_MOUNT(fs);
  SPIFFS_LOCK(fs);

  fh = SPIFFS_FH_UNOFFS(fs, fh);

  spiffs_fd *fd;
  res = spiffs_fd_get(fs, fh, &fd);
  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);

#if SPIFFS_CACHE_WR
  res = spiffs_fflush_cache(fs, fh);
  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);
#endif

  res = (fd->fdoffset >= (fd->size == SPIFFS_UNDEFINED_LEN ? 0 : fd->size));

  SPIFFS_UNLOCK(fs);
  return res;
}

s32_t SPIFFS_tell(spiffs *fs, spiffs_file fh) {
  s32_t res;
  SPIFFS_API_CHECK_CFG(fs);
  SPIFFS_API_CHECK_MOUNT(fs);
  SPIFFS_LOCK(fs);

  fh = SPIFFS_FH_UNOFFS(fs, fh);

  spiffs_fd *fd;
  res = spiffs_fd_get(fs, fh, &fd);
  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);

#if SPIFFS_CACHE_WR
  res = spiffs_fflush_cache(fs, fh);
  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);
#endif

  res = fd->fdoffset;

  SPIFFS_UNLOCK(fs);
  return res;
}

s32_t SPIFFS_set_file_callback_func(spiffs *fs, spiffs_file_callback cb_func) {
  SPIFFS_LOCK(fs);
  fs->file_cb_f = cb_func;
  SPIFFS_UNLOCK(fs);
  return 0;
}

#if SPIFFS_IX_MAP

s32_t SPIFFS_ix_map(spiffs *fs,  spiffs_file fh, spiffs_ix_map *map,
    u32_t offset, u32_t len, spiffs_page_ix *map_buf) {
  s32_t res;
  SPIFFS_API_CHECK_CFG(fs);
  SPIFFS_API_CHECK_MOUNT(fs);
  SPIFFS_LOCK(fs);

  fh = SPIFFS_FH_UNOFFS(fs, fh);

  spiffs_fd *fd;
  res = spiffs_fd_get(fs, fh, &fd);
  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);

  if (fd->ix_map) {
    SPIFFS_API_CHECK_RES_UNLOCK(fs, SPIFFS_ERR_IX_MAP_MAPPED);
  }

  map->map_buf = map_buf;
  map->offset = offset;
  // nb: spix range includes last
  map->start_spix = offset / SPIFFS_DATA_PAGE_SIZE(fs);
  map->end_spix = (offset + len) / SPIFFS_DATA_PAGE_SIZE(fs);
  memset(map_buf, 0, sizeof(spiffs_page_ix) * (map->end_spix - map->start_spix + 1));
  fd->ix_map = map;

  // scan for pixes
  res = spiffs_populate_ix_map(fs, fd, 0, map->end_spix - map->start_spix + 1);
  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);

  SPIFFS_UNLOCK(fs);
  return res;
}

s32_t SPIFFS_ix_unmap(spiffs *fs,  spiffs_file fh) {
  s32_t res;
  SPIFFS_API_CHECK_CFG(fs);
  SPIFFS_API_CHECK_MOUNT(fs);
  SPIFFS_LOCK(fs);

  fh = SPIFFS_FH_UNOFFS(fs, fh);

  spiffs_fd *fd;
  res = spiffs_fd_get(fs, fh, &fd);
  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);

  if (fd->ix_map == 0) {
    SPIFFS_API_CHECK_RES_UNLOCK(fs, SPIFFS_ERR_IX_MAP_UNMAPPED);
  }

  fd->ix_map = 0;

  SPIFFS_UNLOCK(fs);
  return res;
}

s32_t SPIFFS_ix_remap(spiffs *fs, spiffs_file fh, u32_t offset) {
  s32_t res = SPIFFS_OK;
  SPIFFS_API_CHECK_CFG(fs);
  SPIFFS_API_CHECK_MOUNT(fs);
  SPIFFS_LOCK(fs);

  fh = SPIFFS_FH_UNOFFS(fs, fh);

  spiffs_fd *fd;
  res = spiffs_fd_get(fs, fh, &fd);
  SPIFFS_API_CHECK_RES_UNLOCK(fs, res);

  if (fd->ix_map == 0) {
    SPIFFS_API_CHECK_RES_UNLOCK(fs, SPIFFS_ERR_IX_MAP_UNMAPPED);
  }

  spiffs_ix_map *map = fd->ix_map;

  s32_t spix_diff = offset / SPIFFS_DATA_PAGE_SIZE(fs) - map->start_spix;
  map->offset = offset;

  // move existing pixes if within map offs
  if (spix_diff != 0) {
    // move vector
    int i;
    const s32_t vec_len = map->end_spix - map->start_spix + 1; // spix range includes last
    map->start_spix += spix_diff;
    map->end_spix += spix_diff;
    if (spix_diff >= vec_len) {
      // moving beyond range
      memset(&map->map_buf, 0, vec_len * sizeof(spiffs_page_ix));
      // populate_ix_map is inclusive
      res = spiffs_populate_ix_map(fs, fd, 0, vec_len-1);
      SPIFFS_API_CHECK_RES_UNLOCK(fs, res);
    } else if (spix_diff > 0) {
      // diff positive
      for (i = 0; i < vec_len - spix_diff; i++) {
        map->map_buf[i] = map->map_buf[i + spix_diff];
      }
      // memset is non-inclusive
      memset(&map->map_buf[vec_len - spix_diff], 0, spix_diff * sizeof(spiffs_page_ix));
      // populate_ix_map is inclusive
      res = spiffs_populate_ix_map(fs, fd, vec_len - spix_diff, vec_len-1);
      SPIFFS_API_CHECK_RES_UNLOCK(fs, res);
    } else {
      // diff negative
      for (i = vec_len - 1; i >= -spix_diff; i--) {
        map->map_buf[i] = map->map_buf[i + spix_diff];
      }
      // memset is non-inclusive
      memset(&map->map_buf[0], 0, -spix_diff * sizeof(spiffs_page_ix));
      // populate_ix_map is inclusive
      res = spiffs_populate_ix_map(fs, fd, 0, -spix_diff - 1);
      SPIFFS_API_CHECK_RES_UNLOCK(fs, res);
    }

